app/Controllers/Home.php

SELECT *
FROM `signup`
WHERE `email` = 'ssandeepraj222@gmail.com'
 LIMIT 1
---
    public function index()
    {

      $data=[];
      helper(['form']);
      if($this->request->getMethod()=='post')
      {
        $rules = [
          'email'=> 'required|valid_email',
          'password'=> 'required|min_length[1]',
        ];
        $errors = [
          'password' => [
            'validateUser'=>'Email or Password do not match'
            ]
        ];

        if(!$this->validate($rules,$errors))
         {
          $data['validation'] = $this->validator;
         }
         else
         {
          //echo 'i am here';
           $model = new SignupModel();

           $admin = $model->where('email',$this->request->getVar('email'))->first();

SELECT *
FROM `signup`
---
    public function dashboard()
    {

      $model = new SignupModel();
      $data['usersdata'] = $model->findAll();

SELECT *
FROM `signup`
WHERE `id` = '3'
 LIMIT 1
---
    public function edit($id)
    {

      $model = new SignupModel();
      if($this->request->getMethod()=='post')
      {

        $newData=[

          'firstname' => $this->request->getVar('firstname'),
          'lastname' => $this->request->getVar('lastname'),
          'email' => $this->request->getVar('email'),
          'phone' => $this->request->getVar('phone'),
          'address' => $this->request->getVar('address'),

        ];

        if($model->update($id,$newData))
        {

          return redirect()->to ('dashboard');
         // $data['Flash_message']= TRUE;
        }

      }
      //echo $id; exit;


       $data['userdata'] = $model->where('id',$id)->first();